cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32TG232F8.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDOG</name>
      <version>5.7.0</version>
      <description>WDOG</description>
      <baseAddress>0x40088000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000F00</resetValue>
          <resetMask>0x00003F7F</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Watchdog Timer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUGRUN</name>
              <description>Debug Mode Run Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM2RUN</name>
              <description>Energy Mode 2 Run Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM3RUN</name>
              <description>Energy Mode 3 Run Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Configuration lock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM4BLOCK</name>
              <description>Energy Mode 4 Block</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWOSCBLOCK</name>
              <description>Software Oscillator Disable Block</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERSEL</name>
              <description>Watchdog Timeout Period Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>Watchdog Clock Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>Command Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Watchdog Timer Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CTRL</name>
              <description>CTRL Register Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>CMD Register Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
<!-- vendorExtions is _reqiuired_ to pass through Schema validation -->
  <vendorExtensions>
    <name>Copyright 2018 Silicon Laboratories, Inc.</name>
    <flashBaseAddress>0x00000000</flashBaseAddress>
    <flashSize>0x00002000</flashSize>
    <flashAccessTypes>rx</flashAccessTypes>
    <sramBaseAddress>0x20000000</sramBaseAddress>
    <sramSize>0x00000800</sramSize>
    <sramAccessTypes>rwx</sramAccessTypes>
  </vendorExtensions>
</device>
